##### [실습] titanic 승객 데이터 활용

In [1]:
import numpy as np
import pandas as pd
import matplotlib.pyplot as plt
import matplotlib
import seaborn as sns

# 한글 폰트 사용을 위한 설정
import matplotlib.font_manager as fm
import matplotlib

font_path = 'C:/Windows/Fonts/batang.ttc'
font = fm.FontProperties(fname=font_path).get_name()
matplotlib.rc('font', family=font)

**컬럼 설명** 
- PassengerId - 승객 고유번호
- Survived - 생존유무(target 값) (0 = 사망, 1 = 생존)
- Pclass - 티켓 클래스 (1 = 1st, 2 = 2nd, 3 = 3rd)
- Name - 탑승객 성명
- Sex - 성별 (male: 남성, female: 여성)
- Age - 나이(세)
- SibSp - 함께 탑승한 형제자매, 배우자 수 총합
- Parch - 함께 탑승한 부모, 자녀 수 총합
- Ticket - 티켓 넘버
- Fare - 탑승 요금
- Cabin - 객실 넘버
- Embarked - 탑승 항구 (C: Cherbourg, Q: Queenstown, S: Southampton)

In [2]:
# titanic.csv 파일 로드
# titanic 데이터셋의 메타 데이터 확인

df = pd.read_csv('./data/titanic.csv')
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

- 기초문제

In [3]:
# 1. 전체 승객 중 생존자의 수와 사망자의 수를 구하여 출력
alive_count = df['Survived'].sum()  # 생존자 수 (1의 개수)
die_count = (df['Survived'] == 0).sum() # 사망자 수 (0의 개수)

print(f'생존자: {alive_count} 명, 사망자: {die_count} 명')

생존자: 342 명, 사망자: 549 명

In [4]:
# 2. 승객 나이의 평균 출력
print(df['Age'].mean())

29.69911764705882

In [5]:
# 3. 1등급 승객 중 운임이 가장 높은 승객의 이름 출력
first_passenger = df[df['Pclass'] == 1]
highest_passenger = first_passenger.sort_values(by='Fare', ascending=False)
# print(highest_passenger)
print(highest_passenger['Name'].iloc[0])

Ward, Miss. Anna

In [6]:
# 4. 여성 승객의 수를 구하여 출력
female_passenger = df[df['Sex'] == 'female']
print(len(female_passenger))

314

In [7]:
# 5. 운임이 50 이상인 승객의 이름과 운임 출력
pay = df[df['Fare'] >= 50]
pay[['Name', 'Fare']]

                                                  Name      Fare
1    Cumings, Mrs. John Bradley (Florence Briggs Th...   71.2833
3         Futrelle, Mrs. Jacques Heath (Lily May Peel)   53.1000
6                              McCarthy, Mr. Timothy J   51.8625
27                      Fortune, Mr. Charles Alexander  263.0000
31      Spencer, Mrs. William Augustus (Marie Eugenie)  146.5208
..                                                 ...       ...
856         Wick, Mrs. George Dennick (Mary Hitchcock)  164.8667
863                  Sage, Miss. Dorothy Edith "Dolly"   69.5500
867               Roebling, Mr. Washington Augustus II   50.4958
871   Beckwith, Mrs. Richard Leonard (Sallie Monypeny)   52.5542
879      Potter, Mrs. Thomas Jr (Lily Alexenia Wilson)   83.1583

[161 rows x 2 columns]

In [8]:
# 6. 나이가 18세 미만인 승객들의 생존율을 계산하여 출력
young = df[df['Age'] < 18]
survival_rate = young['Survived'].mean() * 100
print(survival_rate,"%")

53.98230088495575 %

In [9]:
# 7. 2등급 객실에 탑승한 승객의 평균 운임을 계산하여 출력
second_passenger = df[df['Pclass'] == 2]
pay = second_passenger['Fare'].mean()
print(pay,"%")

20.662183152173913 %

In [10]:
# 8. 승객 중 나이가 가장 많은 사람의 나이와 이름을 출력
oldder_passenger = df.sort_values(by='Age', ascending=False).iloc[0]
oldder_passenger[['Age', 'Name']]

Age                                     80.0
Name    Barkworth, Mr. Algernon Henry Wilson
Name: 630, dtype: object

In [11]:
# 9. S 항구에서 탑승한 승객의 수를 출력
s_port_passenger = df[df['Embarked'] == 'S']
print(len(s_port_passenger))

644

In [12]:
# 10. 3등급 객실에 탑승한 남성 승객 중 생존자의 수를 출력
class_room3 = df[(df['Pclass'] == 3) & (df['Sex'] == 'male')]
print(len(class_room3))

347

- 고급문제

In [23]:
df

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S
...,...,...,...,...,...,...,...,...,...,...,...,...
886,887,0,2,"Montvila, Rev. Juozas",male,27.0,0,0,211536,13.0000,NaN,S
887,888,1,1,"Graham, Miss. Margaret Edith",female,19.0,0,0,112053,30.0000,B42,S
888,889,0,3,"Johnston, Miss. Catherine Helen ""Carrie""",female,NaN,1,2,W./C. 6607,23.4500,NaN,S
889,890,1,1,"Behr, Mr. Karl Howell",male,26.0,0,0,111369,30.0000,C148,C
890,891,0,3,"Dooley, Mr. Patrick",male,32.0,0,0,370376,7.7500,NaN,Q

In [27]:
# 1. 생존자(Survived)와 그렇지 않은 사람들의 `Pclass`(객실 등급)별 평균 나이를 각각 출력

mean_age_by_survival = df.groupby('Survived')['Age'].mean()
print(f"생존자의 평균 나이: {mean_age_by_survival[1]:.2f}세")
print(f"비생존자의 평균 나이: {mean_age_by_survival[0]:.2f}세")

생존자의 평균 나이: 28.34세
비생존자의 평균 나이: 30.63세

In [28]:
# 2. `SibSp`(형제/배우자 수)가 3 이상인 승객들 중에서, `Fare`(운임) 상위 5명의 이름과 나이를 출력
sibsp_3plus = df[df['SibSp'] >= 3]
top5_fare = sibsp_3plus.sort_values('Fare', ascending=False).head(5)
print(top5_fare[['Name', 'Age']])

                               Name   Age
27   Fortune, Mr. Charles Alexander  19.0
88       Fortune, Miss. Mabel Helen  23.0
341  Fortune, Miss. Alice Elizabeth  24.0
159      Sage, Master. Thomas Henry   NaN
180    Sage, Miss. Constance Gladys   NaN

In [30]:
# 3. 승객 중에서 `Age` 값이 결측치(NaN)인 사람들의 `Embarked`(탑승 항구)별 분포를 출력
embarked_nan_age = df[df['Age'].isna()]['Embarked'].value_counts()
print(embarked_nan_age)

Embarked
S    90
Q    49
C    38
Name: count, dtype: int64

In [31]:
# 4. 나이가 16세 미만이고, 혼자 탑승한(`SibSp == 0` and `Parch == 0`) 승객의 이름과 성별, 생존 여부를 출력

under_16 = df[(df['Age'] < 16) & (df['SibSp'] == 0) & (df['Parch'] == 0)][['Name', 'Sex', 'Survived']]
print(under_16)

                                     Name     Sex  Survived
14   Vestrom, Miss. Hulda Amanda Adolfina  female         0
22            McGowan, Miss. Anna "Annie"  female         1
731              Hassan, Mr. Houssein G N    male         0
777         Emanuel, Miss. Virginia Ethel  female         1
780                  Ayoub, Miss. Banoura  female         1
875      Najib, Miss. Adele Kiamie "Jane"  female         1

In [34]:
# 5. 1등급(Pclass == 1) 객실에 탑승한 승객들 중에서, 운임(Fare)이 평균보다 높은 사람들의 이름과 나이, 운임을 출력

# 1등급 객실 승객만 추출
first_class = df[df['Pclass'] == 1]

# 1등급 객실 승객 평균 운임
mean_first_fare = first_class['Fare'].mean()

# 운임이 평균보다 높은 승객 추출
above_mean_fare = first_class[first_class['Fare'] > mean_first_fare]
display(above_mean_fare)

,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
27,28,0,1,"Fortune, Mr. Charles Alexander",male,19.0,3,2,19950,263.0000,C23 C25 C27,S
31,32,1,1,"Spencer, Mrs. William Augustus (Marie Eugenie)",female,NaN,1,0,PC 17569,146.5208,B78,C
88,89,1,1,"Fortune, Miss. Mabel Helen",female,23.0,3,2,19950,263.0000,C23 C25 C27,S
118,119,0,1,"Baxter, Mr. Quigg Edmond",male,24.0,0,1,PC 17558,247.5208,B58 B60,C
195,196,1,1,"Lurette, Miss. Elise",female,58.0,0,0,PC 17569,146.5208,B80,C
...,...,...,...,...,...,...,...,...,...,...,...,...
779,780,1,1,"Robert, Mrs. Edward Scott (Elisabeth Walton Mc...",female,43.0,0,1,24160,211.3375,B3,S
802,803,1,1,"Carter, Master. William Thornton II",male,11.0,1,2,113760,120.0000,B96 B98,S
820,821,1,1,"Hays, Mrs. Charles Melville (Clara Jennings Gr...",female,52.0,1,1,12749,93.5000,B69,S
849,850,1,1,"Goldenberg, Mrs. Samuel L (Edwiga Grabowska)",female,NaN,1,0,17453,89.1042,C92,C
856,857,1,1,"Wick, Mrs. George Dennick (Mary Hitchcock)",female,45.0,1,1,36928,164.8667,NaN,S

In [36]:
# 6. 나이(Age), 객실 등급(Pclass), 운임(Fare) 값에 결측치가 없는 승객들만 대상으로, 각 등급별 평균 운임과 중앙값 운임을 출력
survival_rate_under_18 = df[df['Age'] < 18]['Survived'].mean()
print(f"18세 미만 생존율: {survival_rate_under_18:.2%}")

18세 미만 생존율: 53.98%

In [41]:
# 7. 승객들의 `Embarked` 별 평균 나이를 계산하고, 가장 많은 승객이 탑승한 항구를 기준으로 생존율을 계산하여 출력
# embarked별 평균 나이
mean_embarked = df.groupby('Embarked')['Age'].mean()
print(mean_embarked)

# 가장 많은 승객이 탑승한 항구 찾기
most_common_port = df['Embarked'].value_counts().idxmax()
print(f"가장 많은 승객이 탑승한 항구: {most_common_port}")

# 해당 항구에서 탑승한 승객 데이터만 추출
port_passengers = df[df['Embarked'] == most_common_port]

# 생존율 계산
survival_rate = port_passengers['Survived'].mean()
print(f"{most_common_port} 항구에서 탑승한 승객의 생존율: {survival_rate:.2%}")

Embarked
C    30.814769
Q    28.089286
S    29.445397
Name: Age, dtype: float64
가장 많은 승객이 탑승한 항구: S
S 항구에서 탑승한 승객의 생존율: 33.70%

In [46]:
# 8. 승객 중에서 여성(`Sex == 'female'`)이면서 30세 이상인 사람들의 생존율을 계산하여 출력

female_up_30 = df[(df['Sex'] == 'female') & (df['Age'] >= 30)]

female_up_30_survival_rate = female_up_30['Survived'].mean()
print(f'여성이면서 30세 이상인 승객의 생존율: {female_up_30_survival_rate: .2%}')

여성이면서 30세 이상인 승객의 생존율:  80.70%

In [48]:
# 9. 동반한 형제 또는 배우자 수(`SibSp`)와 부모 또는 자녀 수(`Parch`)의 합이 3 이상인 승객들만을 대상으로, 그들의 생존율을 계산하여 출력

family_group = df[(df['SibSp'] + df['Parch']) >= 3]

# 생존율 계산
survival_rate = family_group['Survived'].mean()
print(f"{survival_rate:.2%}")

34.07%

In [52]:
# 10. `Cabin`(객실 번호) 정보가 있는 승객들만을 대상으로, 그들의 생존율을 객실 등급별로 구분하여 계산하여 출력
# Cabin 정보가 있는 승객만 추출 (결측치가 아닌 값)
has_cabin = df[df['Cabin'].notna()]

# 객실 등급별(Pclass) 생존율 집계
survival_by_class = has_cabin.groupby('Pclass')['Survived'].mean()

print("Cabin 정보가 있는 승객의 객실 등급별 생존율:")
for pclass, rate in survival_by_class.items():
    print(f"{pclass}등급: {rate:.2%}")

Cabin 정보가 있는 승객의 객실 등급별 생존율:
1등급: 66.48%
2등급: 81.25%
3등급: 50.00%